tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "r-lib/rig"
tap "remove-bg/tap"
tap "romkatv/powerlevel10k"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Modern replacement for 'ls'
brew "exa"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Improved top (interactive process viewer)
brew "htop"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Manipulate OpenType and multiple-master fonts
brew "lcdf-typetools"
# Pager program similar to more
brew "less"
# Terminal file manager
brew "lf"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Fast, highly customisable system info script
brew "neofetch"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Utility that provides fast incremental file transfer
brew "rsync"
# Version control system designed to be a better CVS
brew "subversion"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Remove image background - 100% automatically
brew "remove-bg/tap/removebg"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Electronics prototyping platform
cask "arduino"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-computer-modern"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-inter"
cask "font-open-sans"
# Web browser
cask "google-chrome"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# Password manager app
cask "keepassxc"
# Animated screen capture application
cask "licecap"
# Open-source, self-hosted Slack-alternative
cask "mattermost"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Spreadsheet software
cask "microsoft-excel"
# Presentation software
cask "microsoft-powerpoint"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Word processor
cask "microsoft-word"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# Open-source software for live streaming and screen recording
cask "obs"
# Cloud storage client
cask "onedrive"
# Desktop virtualization software
cask "parallels"
# Screen measuring tool
cask "pixelsnap"
# Environment for statistical computing and graphics
cask "r"
# The R Installation Manager
cask "rig"
# Data science software focusing on R and Python
cask "rstudio"
# Instant messaging application focusing on security
cask "signal"
# Music streaming service
cask "spotify"
# Quicklook extension for source files
cask "syntax-highlight"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Configurable document editor that supports Markdown
cask "typora"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
mas "Enpass", id: 732710998
mas "Keynote", id: 409183694
mas "Keyshape", id: 1223341056
mas "Microsoft Remote Desktop", id: 1295203466
mas "Pages", id: 409201541
mas "Quick Camera", id: 598853070
