# Taps (Repositories)
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Brews (Packages, Formulae)
brew "bat" # better cat
brew "exa"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "htop"
brew "httpie" # use with http for better curl
brew "lcdf-typetools" # adobe-fonts downloader
brew "lf"
brew "mas"
brew "n"
brew "neofetch"
brew "pandoc"
brew "rsync"
brew "tldr"
brew "tmux"
brew "youtube-dl"
brew "zsh"

# Casks (Applications)
cask "adobe-creative-cloud"
cask "alfred"
cask "alt-tab"
cask "arduino"
cask "enpass"
cask "keepassxc"
cask "licecap"
cask "mattermost"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "nextcloud"
cask "obs"
cask "onedrive"
cask "opensesame"
cask "pixelsnap"
cask "rectangle"
cask "r" # because of https://rstats.wtf/set-up-an-r-dev-environment.html#what-about-homebrew
cask "rstudio"
cask "spotify"
cask "telegram"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "whatsapp"
cask "zoom"

# App Store
mas "Microsoft Remote Desktop", id: 1295203466













